# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [17]:
series_1 = pd.Series(np.random.randint(1, 4, 100))
series_2 = pd.Series(np.random.randint(1, 3, 100))
series_3 = pd.Series(np.random.randint(10000, 30000, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [20]:
df = pd.concat([series_1, series_2, series_3], axis=1)
df.head()

   0  1      2
0  1  2  29652
1  2  1  10201
2  2  2  17525
3  1  2  11468
4  2  2  22966

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [22]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            29652
1      2       1            10201
2      2       2            17525
3      1       2            11468
4      2       2            22966

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [30]:
bigcolumn = pd.concat([series_1, series_2, series_3])

bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       1
1       2
2       2
3       1
4       2
..    ...
95  27419
96  16064
97  11072
98  24943
99  11368

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [32]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [41]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        2
2        2
3        1
4        2
..     ...
295  27419
296  16064
297  11072
298  24943
299  11368

[300 rows x 1 columns]